# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "heroku/brew"
tap "eth-p/software"

# Brews (Packages)
brew "automake"
brew "bat"
brew "coreutils"
brew "docker"
brew "dropbox"
brew "eth-p/software/bat-extras"
brew "exa"
brew "ffmpeg"
brew "git"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "lua"
brew "luarocks"
brew "mongodb-community"
brew "macvim"
brew "mas"
brew "nvm"
brew "node"
brew "p7zip"
brew "sox"
brew "thefuck"
brew "tmux"
brew "yarn"
brew "youtube-dl"

# Casks (Applications)
cask "alfred"
cask "blackhole"
cask "brave-browser"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "nota"
cask "notion"
cask "postman"
cask "rectangle"
cask "slack"
cask "tidal"
cask "visual-studio-code"
cask "zoom"

# Mac App Store Applications
mas "Snappy", id: 512617038